Ran Plan for dir: `infra/terraform/env/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # azurerm_container_registry.acr will be created
+ resource "azurerm_container_registry" "acr" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "koreacentral"
      + login_server                  = (known after apply)
      + name                          = "acrstocklensyslee0419"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "rg-stocklens-msa"
      + retention_policy              = (known after apply)
      + sku                           = "Standard"
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d infra/terraform/env/dev
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://SandboxHost-639097491906805074:4141/lock?id=Takaluk%252Fatlantis-azure-devsecops%252Finfra%252Fterraform%252Fenv%252Fdev%252Fdefault%252F)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d infra/terraform/env/dev
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```